<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Diagnosis>
 */
class DiagnosisFactory extends Factory
{

    protected static $names = [
        "مشكلة في بطارية السيارة",
        "مشكلة في نظام الشحن",
        "مشكلة في مضخة الوقود",
        "تسرب زيت المحرك",
        "مشكلة في نظام العادم",
        "تلف في نظام التبريد",
        "مشكلة في علبة التروس",
        "اهتزاز أو اهتزاز غير طبيعي",
        "ضوء تحذير على لوحة العدادات",
        "مشكلة في نظام الفرامل",
        "مشكلة في نظام التعليق",
        "ضوء تحذير لمنظومة التحكم في الثبات",
        "عطل في نظام الإشعال",
        "اهتراء أو تلف في إطارات السيارة",
        "تسرب في سائل ناقل الحركة",
        "مشكلة في نظام التكييف والتدفئة",
        "مشكلة في نظام الكهرباء والإضاءة",
        "اهتراء أو تلف في مكونات العجلات",
        "عدم انتظام في أداء المحرك",
        "ضوء تحذير لنظام توزيع قوى الفرامل",
        "ضوء تحذير لنظام مانع الانغلاق",
        "مشكلة في نظام الدفع الرباعي",
        "مشكلة في نظام التوجيه",
        "مشكلة في نظام الإطارات",
        "تسرب في سوائل المراقبة",
        "التحذير الضوئي",
        "مشكلة تشغيل المحرك",
        "صرفية الوقود الكبير",
        "ارتفاع الحرارة",
        "نهاية العمر الافتراضي للبطارية",
        "تغيير اطارات السيارة",
        "صوت المكابح",
        "عطل بدء تشغيل المحرك",
    ];

    public function definition(): array
    {
        return [
            'name' => config('app.env')=== 'testing' ? fake()->unique()->sentences(3,true) : $this->faker->unique()->randomElement(self::$names) . ' ' . rand(0, 10),
        ];
    }
}
